# Overview 

Dataset of Forbes billionaire list 2021. 

- Name
- NetWorth
- Country
- Source
- Rank
- Age
- Residence
- Citizenship
- Status
- Children
- Education
- Self_made
- geometry

# Motivation

Using the dataset to explore the following:

- What country has the most billionares
- Name/Source of income for billionaires 
- Networth of top billionares 
- Percentage of self-made billionare
- Education /School of billionaries 
- Average age of billionaires 
- Education / billionare correlation 

# Dataset source 

Dataset is from Kaggle: https://www.kaggle.com/alexanderbader/forbes-billionaires-2021-30

In [2]:
# Import Libraries 
import pandas as pd
import numpy as np
import seaborn as sns

# Initial Inspection of Data

In [3]:
#Read in data 
df = pd.read_csv('forbes_billionaires_geo.csv')
df.head()

,Name,NetWorth,Country,Source,Rank,Age,Residence,Citizenship,Status,Children,Education,Self_made,geometry
0,Jeff Bezos,177.0,United States,Amazon,1,57.0,"Seattle, Washington",United States,In Relationship,4.0,"Bachelor of Arts/Science, Princeton University",True,POINT (-122.3300624 47.6038321)
1,Elon Musk,151.0,United States,"Tesla, SpaceX",2,49.0,"Austin, Texas",United States,In Relationship,7.0,"Bachelor of Arts/Science, University of Pennsy...",True,POINT (-97.74369950000001 30.2711286)
2,Bernard Arnault & family,150.0,France,LVMH,3,72.0,"Paris, France",France,Married,5.0,"Bachelor of Arts/Science, Ecole Polytechnique ...",False,POINT (2.3514616 48.8566969)
3,Bill Gates,124.0,United States,Microsoft,4,65.0,"Medina, Washington",United States,Divorced,3.0,"Drop Out, Harvard University",True,POINT (-122.2264453 47.620548)
4,Mark Zuckerberg,97.0,United States,Facebook,5,36.0,"Palo Alto, California",United States,Married,2.0,"Drop Out, Harvard University",True,POINT (-122.1598465 37.4443293)

In [4]:
df.shape

(2755, 13)

In [20]:
df.columns

Index(['Name', 'NetWorth', 'Country', 'Source', 'Rank', 'Age', 'Residence',
       'Citizenship', 'Status', 'Children', 'Education', 'Self_made',
       'geometry'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2755 entries, 0 to 2754
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         2755 non-null   object
 1   NetWorth     2755 non-null   float64
 2   Country      2755 non-null   object
 3   Source       2755 non-null   object
 4   Rank         2755 non-null   int64
 5   Age          2630 non-null   float64
 6   Residence    2715 non-null   object
 7   Citizenship  2739 non-null   object
 8   Status       2090 non-null   object
 9   Children     1552 non-null   float64
 10  Education    1409 non-null   object
 11  Self_made    2737 non-null   object
 12  geometry     2755 non-null   object
dtypes: float64(3), int64(1), object(9)
memory usage: 279.9+ KB

In [16]:
df.duplicated().sum()

0

In [19]:
df.isnull().sum()

Name              0
NetWorth          0
Country           0
Source            0
Rank              0
Age             125
Residence        40
Citizenship      16
Status          665
Children       1203
Education      1346
Self_made        18
geometry          0
dtype: int64

__Conclusion from initial inspection__

- Column data types are ok 
- Chidlren, status, geometry column can be removed 
- Missing values can be replaced with mean

-----

# Cleaning Process